an
a
ar
go
ag
url
tá
i
mé
na
agus
le
is
ach
sin
é
maith
sé
ní
mo
bhfuil
agam
seo
raibh
níl
liom
bhí
do
tú
in
sa
as
ann
mar
agat
leis
anois
nach
ó
beidh
orm
gaeilge
d
faoi
atá
lá
inniu
mór
aon
eile
anseo
níos
#gaeilge
dul
iontach
rud
de
ná
don
súil
anocht
bheith
chomh
leat
mise
féin
táim
muid
sibh
mhaith
obair
amach
bith
míle
me
againn
grma
linn
nó
fad
gur
gan
fós
siad
san
gach
ba
ais
oíche
arís
mbeidh
duine
half
chun
amárach
nuair
freisin
ina
am
maidin
ta
#gaeilige
féidir
ceart
cén
fhios
den
deireadh
ceann
deas
thú
nd
fearr
nua
iad
leor
air
cad
agaibh
dom
duit
cinnte
the
mins
dtí
daoine
dhéanamh
scéal
dobhair
dé
chara
níor
ah
teacht
gaoth
ón
ansin
sí
mó
fáil
bheidh
acu
chuid
amháin
isteach
má
thar
ort
á
uair
seachtain
tar
seachtaine
faoin
trua
chur
breá
áit
to
bocht
rinne
fáth
déanamh
naomh
caithfidh
caint
beag
díreach
so
iarraidh
cúpla
buíochas
dá
chairde
faraor
libh
bhuel
brón
ghaeilge
fáilte
í
sásta
chéad
bheadh
ár
fada
cé
rá
luath
oh
s
nil
no
cur
bain
éis
seans
haha
o
bí
chuig
sult
siúl
fear
twitter
focal
on
láthair
mbeadh
ha
scoil
for
abhaile
chugainn
léir
nollaig
teanga
fuair
céard
b'fhéidir
idir
bíonn
you
álainn
cosúil
chuir
beo
roimh
fiú
aimsir
labhairt
fóill
chéile
céanna
ni
thart
orainn
fíor
cuma
lán
dóigh
comhghairdeas
bhfad
tu
béarla
fháil
dia
se
cá
bhliain
and
shin
cluiche
clár
#tg
éigin
shona
saol
n-éirí
fhéin
dhá
déanta
tinn
riamh
bliain
amarach
uaim
imithe
fosta
bhaile
tusa
neart
chuala
uilig
sraith
sna
nós
chroí
leo
fanacht
dearmad
scoth
rang
leabhar
éinne
oiread
mbliana
lae
it
of
mac
rith
léamh
dúirt
daoibh
slán
p
hálainn
cheann
ceol
breathnú
tseachtain
tg
nílim
conas
más
gcónaí
tír
oiche
fheiceáil
deacair
aréir
aghaidh
suas
éirinn
dócha
brónach
baile
smaoineamh
ainm
thabhairt
teach
st
inniú
abú
gceist
fadhb
éisteacht
hiontach
ú
rudaí
átha
at
scríobh
cuir
codladh
c
aige
trí
uafásach
measa
lucht
chaill
bhíonn
bhi
sneachta
mhór
cheana
úsáid
tnúth
domhain
chuile
ádh
tae
ngaeilge
fheabhas
ea
drochuair
ard
saor
nár
dó
taitneamh
inné
sílim
pm
leaba
feadh
craic
bhur
bhreá
bhfuair
agamsa
tuigim
táimid
haghaidh
chonaic
thug
cuid
bíodh
bígí
bbc
orthu
oraibh
leath
from
eolas
e
chor
tháinig
fuath
sea
béal
féach
time
mí
amuigh
taobh
oibre
la
cheap
nollag
just
deo
deireanach
craobh
cheart
saoire
roinn
óg
dúinn
baint
#
yeah
mbaile
irish
fágtha
éirí
éad
tharla
mbíonn
laghad
bhain
méid
aw
tús
ndiaidh
l
domsa
cinn
b
thoil
seachas
istigh
féile
beagnach
turas
oifig
liomsa
fhaca
cead
aoine
tweet
tacaíocht
sinsear
roinnt
my
lol
ceannais
bua
síos
ró
ndóigh
leithscéal
grmma
bean
bás
aww
son
siar
rogha
minic
dhuit
briste
t-am
nuacht
héireann
féachaint
dhuine
suíomh
réidh
play
ngall
lena
dona
cuireann
aríst
@
uisce
toisc
that
romhat
not
ie
iarracht
gá
focail
déardaoin
be
aoibhinn
aoibh
áfach
this
sona
mbác
leanúint
hi
gaeil
feirste
deis
déanaí
ceapaim
bhíos
tuirseach
#trasnanadtonnta
píosa
n
grá
gheall
gháire
fá
éire
eagla
cill
chloisteáil
chaoi
abair
smile
meas
foghlaim
déan
cliath
tada
rún
ros
m
dara
but
wow
tabhair
gceart
droch
dóibh
chóir
ceist
buartha
bliana
bharr
ucht
raidió
nasc
gaeltachta
fuar
curtha
cuimhin
conaill
chuaigh
sure
pádraig
náire
leagan
lár
caillte
bhfaca
beannachtaí
bác
réir
#onas
náireach
líne
like
iomlán
gceann
gaillimh
fhéile
chlár
bhean
with
mná
laethanta
g
feicfidh
fé
dabht
chugat
by
all
via
tráthnóna
today
iomarca
dearg
comhrá
bhaint
v
uirthi
uait
seoladh
point
os
ngaillimh
muintir
mbéarla
luain
lorg
léigh
leatsa
imeacht
caite
anuas
ama
timpeall
taim
scrúdú
mor
measc
leithéid
gáire
full
deir
chugam
brea
báisteach
uainn
thiar
#snag
post
our
mícheart
leith
fan
éist
dar
ata
anam
amhrán
up
ollscoil
mile
fein
domhan
diabhal
dheireadh
críochnaithe
chodladh
ceoil
barr
an-mhaith
alt
suil
samhradh
pic
mban
lean
leabhair
ds
dochreidte
díomá
dheis
déarfainn
a'm
achan
tí
tabhairt
mórán
happy
gaelach
fonn
dún
dtús
dhia
deanamh
cupla
club
aire
your
úr
t-ádh
siopa
sibhse
sámh
páistí
oireachtas
maidir
habair
gnáth
gleann
dhéanann
deimhin
déanfaidh
beirt
uile
thuigim
spraoi
mhac
magadh
liosta
lads
have
good
gaeltacht
caoineadh
blianta
bhealach
tosú
shíl
sam
#rnar
ranganna
máirt
imirt
ghrian
geal
fir
feidir
facebook
day
cúrsaí
ball
bac
aici
uí
thosaigh
suim
stór
rua
right
pointe
léi
i'm
hiomlán
háirithe
ghaeltacht
gcoinne
gael
#gaa
cuairt
#comhrá
comh
chaitheamh
bualadh
bís
bia
bheas
what
well
théis
thaitin
shaol
seomra
sean
saghas
plé
ok
now
marbh
know
great
freagra
dhaoine
bheinn
báistí
amharc
agallamh
ábhar
u
tíre
thaobh
scoile
ól
muire
mhaise
lón
it's
hahaha
gréine
croí
chartha
chaith
cara
caife
bheag
airgead
aice
ahh
aer
rialtas
ndáiríre
mothaím
lámh
inis
im
haon
gcuid
gclár
galánta
gabh
foireann
feicim
dár
cuirfidh
coinnigh
chluiche
cheist
breithlá
are
uimhir
stop
staidéar
sos
scéalta
mhacha
mall
liath
greannmhar
gcéad
gaillimhe
fliuch
fhoghlaim
fair
éasca
di
dhó
dhiaidh
dhaoibh
deirtear
clann
céad
cailín
aisteach
one
mháthair
luaithe
litir
labhair
hey
here
feiceáil
dti
deise
daltaí
comhghairdeachas
cheannach
cairde
b'fheidir
bán
awh
ait
abán
uaireanta
thig
thanks
te
scannán
roimhe
pictiúr
peile
nios
mbun
mbealach
luan
gurb
gcéanna
físeán
dubh
bhocht
beaga
amhras
aithne
we
togha
titim
tinneas
thíos
siúd
satharn
out
nóiméad
ngael
new
mhí
leaids
haoine
#gaeilgechat
fud
éirigh
domhnaigh
cúrsa
claonta
chuige
athrú
uladh
ugh
tuillte
triail
thuas
teastáil
táimse
scéil
r
peil
ocras
moladh
mbéal
love
liam
gconamara
faighte
f
domhnach
domh
dhul
cupán
chloig
céadaoin
bun
aiste
will
t
sinn
seol
sách
rnag
páirt
oscailt
ollmhór
muna
londain
ldt
láidir
íontach
h
get
feachaint
damhsa
dála
cúl
cuireadh
cleachtadh
cibé
ccé
cainte
ca
blas
back
ariamh
was
thuig
thagann
tamall
stad
slaghdán
sheoladh
seán
scór
sathairn
ríomhaire
radharc
points
ormsa
night
mhic
locht
líofa
léinn
john
ithe
hoíche
glaoch
duitse
cúnamh
croíbhriste
cool
colmcille
cionn
casadh
breithe
bhíomar
ana
yep
theach
thall
pé
ochón
mura
lofa
leading
joe
glas
filleadh
fheiscint
feicthe
caitheamh
bron
b'fhearr
aontaím
aois
anuraidh
t-aon
spéir
ráite
ngrá
miss
loch
life
leathanach
lear
freastal
fios
fath
dm
dhíth
comórtas
co
class
ciall
chlog
cheannaigh
ceapadh
bus
botún
bhíodh
bhéal
athbhliain
aris
uafasach
trasna
thuilleadh
thóg
taisteal
srl
seó
scríofa
sasana
réabhlóid
ngach
n'fheadar
ndearna
mhuintir
madra
lenár
lasmuigh
jab
fb
faic
doire
dheas
deiridh
dáiríre
cóip
chraic
cen
biseach
awww
aimsiú
ábalta
tirim
though
teachtaireacht
tarlú
tagairt
shamhna
rrr
#rosnarún
really
peadar
or
more
lú
fóir
fhear
fadó
éireannach
éireann
easpa
doigh
dheireanach
cuidiú
ciúin
chuireann
chónaí
can't
bródúil
bhuaigh
bhfuilim
beimid
an-deas
yay
tv
téarma
taifead
suimiúil
speisialta
spás
sasta
sasanach
pobal
óna
null
measaim
máire
maigh
ionad
imní
iarthar
hé
google
gnóthach
gafa
fón
foill
fearg
eoin
dun
díoma
dheanamh
deara
cúis
coláiste
choinne
cat
cac
brú
bog
áirithe
agatsa
abalta
vóta
uachtar
traochta
tigh
thu
sf
scamallach
mian
meáin
laoch
fos
fhadhb
faraoir
faigh
dtiocfaidh
dteanga
don't
crua
chonaill
cheanna
chás
cailleadh
bím
bhéarla
beatha
bealtaine
barraíocht
banna
bainigí
aye
amú
ahhh
ab
uaidh
tuairisc
trom
trá
tosaigh
too
tonight
tóg
theip
theanga
sula
stair
spéis
samhna
s'againne
rugbaí
rath
rachaidh
rabhas
pionta
óige
oibríonn
mara
ireland
íosa
hup
gleoite
ghaoth
foclóir
fianna
fadhbanna
eh
dtig
dteagmháil
deoch
déanann
comhair
chontae
chead
charr
ceithre
cathain
carr
bhus
arais
alright
aisce
airde
uasal
tuirse
tsamhraidh
tosnú
tiocfaidh
téigh
tagann
spéisiúil
sheol
scrúduithe
said
ponc
póit
ortsa
olc
óga
náisiúnta
múinteoir
man
ma
hoibre
hello
gheobhaidh
geallta
gaeilgeoirí
fm
fhoireann
faire
failte
fágáil
eoghain
eo
duais
deireann
cumann
chúis
cheoil
cailíní
buachaill
#brodclub
blasta
bhuail
bheirt
beannacht
aontaithe
year
ya
wish
tuilleadh
trácht
tine
that's
teas
#súileile
suaimhneas
stoirm
sorry
snapchat
si
see
scaip
plean
pian
phobal
off
ngallóglach
múinteoirí
múineadh
mbreatain
lig
lan
iontas
idirlíon
haigh
goa
glan
ghlac
gearán
gabháil
free
foirfe
fógra
fís
fírinne
dteach
dream
dorcha
doras
dóchas
dlí
dhún
deasa
déanach
craiceáilte
comortas
coicís
cluichí
clú
cloisteáil
clochán
cliste
chloigeann
chathair
#ceol
céilí
caithfear
briseadh
bogadh
bhris
bealach
áthas
an-chuid
amhlaidh
albain
airgid
about
very
us
tráth
torthaí
t-léine
there
taithí
tagtha
tadhg
tà
stáit
#sneachta
seolta
seacláid
rphost
réiteach
phost
oileán
nior
niall
ngaeltacht
ndún
muidne
mothú
meiriceá
m'ainm
leadránach
ionadh
gurbh
grianghraf
glacadh
giota
ghlacadh
gcomhair
gcill
gcathair
fuck
d'imigh
dána
creidim
corcaigh
conamara
colm
cineál
ciarraí
chéanna
cathrach
can
buiochas
b'shin
bronntanas
bpáirc
bhfeicfidh
beir
aimsire
#aimsir
week
wanna
um
tríd
traenáil
thuiscint
thuaidh
tho
teocht
teilifís
talamh
taitníonn
sonraí
slí
scrudu
scriosta
say
salach
romham
réalt
polaitiúil
please
omg
nope
niamh
neirbhíseach
móra
min
michael
mbóthar
luí
lathair
intinn
hea
haimsire
hah
gruaige
grand
gramadach
gcuimhne
gaofar
frása
fhocal
fhírinne
fhinne
fhágáil
eolais
eitilt
dtoil
dochar
dhuibhne
dhom
dheirfiúr
dhein
cúramach
craoladh
contae
cónaí
comhluadar
clg
chúl
chreidim
chailín
ceard
cás
caidé
bronach
breathnaíonn
bochta
bhuíochas
bhfolach
beagán
ara
againne
again
actually
wifi
want
ullmhú
uaigneach
uaibh
tvuít
tuige
tugtha
tomorrow
tom
todhchaí
tíortha
ticéid
ticéad
thugann
thit
th
taighde
suí
stuif
stiúideo
spórt
sórt
sláinte
siopaí
sine
shlí
scannáin
ré
ra
pop
player
pics
paul
páirteach
oth
oscailte
ólta
oifigiúil
ndeachaigh
much
muc
míosa
meán
márta
lurgan
luimneach
leanann
ionann
inár
hmm
got
gnó
giolla
gig
ghnáth
gcorcaigh
gcluiche
#gaeltacht
gaelige
fuaireas
follow
fluich
fhrainc
fhéidir
fheicim
fheiceail
fhada
faitíos
faigheann
eicínt
eaglais
d'fhág
deanta
dcu
da
cos
corn
comhairle
cóisir
cois
cloich
ciarán
chill
ceal
canadh
buaiteoir
buachaillí
brí
bóthar
bhrí
bháisteach
arabacha
aoibheann
adh
ad
youtube
you're
why
weekend
ucd
tweets
tugann
tolg
tógáil
tiomáint
té
tarlaíonn
tábhachtach
still
stealladh
stát
sráid
slan
shuí
seolfaidh
#seachtainnagaeilge
scrúdaithe
scannalach
sasanaigh
samhraidh
rothar
ráiteas
raidio
phlé
páiste
ós
ndoire
nar
month
moltaí
milis
mhoill
mbus
mas
maire
madraí
#lnag
litriú
linne
léite
leantóirí
leanbh
leabharlann
iúil
íomhá
íoc
if
iarradh
hard
ghrá
ghoid
gconaí
gaoithe
galanta
ga
fuaim
frithshóisialch
fresin
final
fadas
eoghan
eagrán
dubs
drochscéal
done
dheartháir
d'éirigh
#dearglefearg
dearcadh
dáta
cuimhne
créatúr
crann
cothrom
col
cloiste
ciorcal
chúrsa
choladh
cheol
cheapann
cheantar
chas
bunaithe
bricfeasta
braithim
binn
bearla
baill
asam
an-sásta
amhráin
alan
áireamh
yum
would
work
vótáil
úd
tuairimí
trump
troid
translate
tráchtas
tóir
thóin
teangacha
súile
shílfeá
seinm
seacht
ríomhphost
rinn
reoite
raonaithe
pól
pictiúir
pearsanta
n-eirí
need
ndán
nah
muide
mícheál
mí-ádh
meon
maithe
mairéad
luchta
luaite
len
léarscáil
jaysus
iristheoirí
iphone
iomaí
how
home
holc
guth
gcomórtas
friday
formhór
fómhair
fhois
fhein
fhaola
feachtas
eis
dtuigeann
dtaobh
down
d'ith
dílis
difriúil
déag
cuntas
cúig
cinneadh
chugaibh
chlub
cearta
cárta
cait
cáca
buíoch
buailte
brexit
breise
boladh
bhfóire
baol
any
years
usaid
uathu
uaimse
tweetáil
tuairim
tionchar
thuras
thuigeann
theacht
thank
teilifíse
téacs
tamaill
t-ainm
sunday
spóirt
some
soir
snámh
smaoinigh
skype
siúil
silim
shúile
sheachtain
shampla
scoileanna
sceitimíní
scamaill
rugadh
rothaíocht
rip
rinneadh
reifreann
rátha
ps
poist
poiblí
padraig
oireachtais
n-óg
nice
néirí
muileann
muice
mionúir
micheál
mhor
mhamaí
mham
meastú
mearbhall
mean
mbliaina
mbainfidh
lúnasa
live
leir
led
leads
language
láithreach
lad
job
#irish
iníon
ind
hope
he
gura
grm
gramadaí
gml
gearr
géar
#ge
gciarraí
gar
#gael
gaa
fuil
fleadh
fíona
feabhra
faoina
fagtha
fág
éineacht
dúnta
dúil
dublin
dtír
droichead
dos
dóite
docha
dinnéar
diabhail
dhith
deora
deochanna
deirneach
dea-scéal
dean
daonlathas
d'aois
dán
daingean
cruinniú
córas
cnaipe
clé
claonadh
cic
ciara
chum
chothú
chomhairle
chéim
cheapas
chat
chan
cgl
céim
ceiliúradh
caitlín
caighdeán
cabhair
buidéal
#bricblasta
breis
bosca
bld
bl
biased
bhriste
bainte
bainne
babhta
#aras
amadán
airne
abairt
yup
wednesday
way
vs
tuít
tsaoil
traein
top
toirt
tógadh
tnuth
téann
tacú
tábhachtaí
sonas
soilse
soiléir
smaointe
slua
shuíomh
shon
sheomra
she
séamus
seachain
sceal
scaipeadh
samhlaigh
rónán
romhaibh
ro
rince
rí
reidh
rann
phádraig
pancóga
omd
ola
óir
ohh
nilim
ngaoth
next
never
moill
millteanach
mhuin
mhíniú
mbliain
mbeifeá
#mauricemccabe
mary
maggie
little
leitir
lei
léan
láithreoir
láirge
lag
km
iontu
iomáint
inti
imeall
idirnáisiúnta
hmmm
háite
grúpa
grian
gránna
gráin
ghaillimh
gcearr
gceannas
galway
gàidhlig
#gaelic
gaeilgeoir
fulaingt
#fleadh
fg
fásta
fás
fadbh
everyone
en
eigin
éigean
éagsúla
eagrú
duleek
duirt
direach
d'inis
difríocht
did
dí
dhoire
dhéanfaidh
d'fhoghlaim
déistineach
deich
dearfach
déanaim
dánta
dad
cumhacht
cultúr
cráite
cosuil
corbyn
columba
coilíneach
chuntas
chosmhuitir
chos
choinneáil
chlé
chlann
chláir
chinn
chailíní
cha
ceolchoirm
caisleán
buail
bród
briseann
brian
bomaite
blian
big
bhrú
bhlian
bhfear
bhaineann
bellewstown
baoill
báite
bainfidh
bail
bad
áras
andy
android
airím
aird
aerfort
yes
ye
welcome
uachtarán
tuigeann
tsuilí
tsír
tréimhsí
toradh
t-oireachtas
thógáil
think
thiarcais
theas
tharlaíonn
teaghlach
tá'n
t-amhrán
tacaíochta
suite
such
spiorad
spidéal
solas
snag
sléibhte
shinsear
sheáin
shábháil
seinnteoir
seinnt
seiceáil
seal
sár
sad
ró-mhaith
róisín
rí-rá
ríomhphoist
port
podchraoladh
pobail
pianmhar
phobail
phic
pháistí
péire
páirtí
ouch
only
oideachas
och
naoi
#náire
mumhan
muise
mothaíonn
misneach
míniú
mic
mhuire
mharaigh
mhaitiú
mhaithe
mhaidin
mhadra
mbeinn
mbeimid
maslach
mapa
luaigh
long
libhse
leigheas
lcd
láimhe
labour
labhróidh
keep
katie
je
its
#ireland
ionam
imeachtaí
idirlín
house
halainn
gúna
#grma
goal
gnách
glac
gealaí
gairid
gaire
#gaillimh
gaels
foinse
fhuinneog
fhéadfainn
feictear
feabhas
fán
fáinne
fail
etc
ep
eite
éan
éalú
dúradh
dúchais
dtreo
domhanda
dhroim
dhiabhail
dhearna
des
déanaigí
days
david
das
cumarsáide
cruinn
croise
creid
could
comhartha
cnoc
clocha
chuma
chrócaigh
christmas
chríochnaigh
choláiste
chol
chistin
chearta
céile
cearr
cealla
cd
casta
cásca
call
caill
brodúil
#bród
bríde
#brexit
breathnaigh
brat
bpáistí
bigí
bi
bhreatain
bhrea
bholg
bhlag
bhfocal
bhfiann
bhéas
bháis
b'fhiú
aonghus
aoife
an-sult
anna
an-fhuar
an-chraic
an-bhrónach
an-bhrón
áitiúil
aistriúchán
aistriú
ae
ááá
working
win
wait
video
ur
úna
ubh
#tusla
tuíteáil
tsraith
truamhéalach
triúr
treo
treabhadh
tosaíonn
tóraí
tithe
times
ticéidí
thrioblóid
théann
tharraingt
thaispeáint
thainig
teagasc
taithneamh
t-airgead
t-ábhar
súp
stuff
streachailt
stáitse
staighre
staid
spáinnis
smacht
siúlóid
siúcra
show
shiúl
shane
seriously
seirbhís
second
seanfhocal
seafóideach
scrabble
scéim
scéala
samhain
samh
r-phost
romhainn
roghnaigh
ró-fhada
retweeted
rd
pub
póca
pizza
phoist
paddy
ollscoile
nuad
níorbh
ndéanfaidh
nais
naíonáin
moran
monuar
molaim
m'iníon
mi
mhéad
meisce
méadú
mbac
mba
may
lua
look
litreacha
líonadh
líon
lí
leoga
learpholl
labhartha
jesus
jeremy
iris
iontacha
inteacht
ins
inne
huaire
hannah
háit
haischlib
greim
gléasta
glacaim
giolc
gclub
gceanna
gáirí
gaelscoil
freagrach
fósta
#fleadhtv
fharraige
fhail
#feiscup
farraige
faide
emma
eisteacht
eanáir
éacht
dúshlán
dráma
domhsa
division
díot
#díomá
dian
dhíol
d'fhéadfadh
deirim
dear
dealraimh
daoibhse
dáil
cursa
#cúla
cúise
cuirim
#croíbhriste
#craic
corca
conor
comhbhrón
cogaidh
ciontach
chreach
chomhair
choir
chiall
cheile
cheapaim
chaint
chách
ceisteanna
ceanna
ceamara
ceachtar
ceacht
cathal
cathair
cártaí
caith
buille
buaileadh
btw
#brónach
breith
breataine
brách
bord
boo
bonn
bóithre
bó
bídeach
bhun
bhuamáil
bhríde
bhím
bhfeidhm
bhfarraige
béile
been
beagáinín
bainis
baineadh
bá
athraíonn
atha
áth
arsa
areir
árann
app
aodh
amhran
amhain
ámh
áiteanna
aip
abu
úúú
úra
úps
údar
tune
tugadh
tuesday
tù
tríú
tri
tomás
tóin
tógfaidh
tobann
thuistí
thosaíonn
thine
then
theastaigh
thaisce
teorainn
teastaíonn
tchífidh
tá's
tapaidh
taitneamhach
táid
tábhacht
sular
staidear
sraithe
sprioc
spreagadh
sotalach
soicind
socraithe
snap
sligeach
sky
síoraí
siopadóireacht
síneadh
síle
seoil
séasúr
scrios
sciobtha
scáth
scanrúil
saoirse
rudai
ró-luath
roimis
roghnú
riail
ráth
rás
ramhar
poll
pilleadh
picnic
phictiúr
ó@user
orthú
#oireachtas
oibriú
ócáid
nimhneach
nic
ngrian
news
neam
ndéanfadh
morning
mmm
mire
mhúinteoir
mholadh
mhéid
mheabhair
mhála
meangadh
méanar
mè
mblag
mbeal
máthair
m'athair
mata
masla
margadh
mamaí
lyons
logainmneacha
litríocht
liofa
link
let
leithead
léirmheas
least
leantóir
leanacht
leaid
leag
last
lámha
laighean
#lágaeilge
kids
james
iúl
ite
ionsaí
into
imigh
i'd
h-iontach
hehe
hashtag
has
hardteiste
hahah
guys
gruama
grammar
gradam
gra
gorta
gloine
gliondar
give
girl
ghuthán
ghlór
gheimhridh
ghairdín
gearóid
gcéadaoin
gasúir
garman
gardaí
garbhán
fuinneamh
friends
forget
followers
fóil
fógraí
foghlamtha
fíon
fiche
fheiceann
fhearthainn
fhearr
fhág
fhad
#ff
ff
feitheamh
feiscint
feic
feckin
fa
eisceacht
eamon
ealaín
éadaí
duaiseanna
dtrioblóid
druidim
dr
dont
donn
donegal
díobh
dhomsa
dheasca
d'fhéadfá
daonna
daithí
cronaím
críochnú
come
coisir
#clg
cleas
clar
cibe
ciallaíonn
chúpla
chuairt
chroim
chroi
chonradh
chonamara
chonai
chionn
chiarraí
cheannsa
cheannacht
ceathanna
ce
cailin
#cabhfuilcaitlin
buí
breithla
bothar
bolscaireacht
bogásacha
bloody
blag
bit
bhuí
bhualadh
bhuachaint
bhreithlá
bhog
bhfíseán
bhfios
bheul
bheaga
best
béidh
beautiful
beach
barra
ban
baineann
athas
a't
argóint
arán
aonar
anyway
another
an-jab
ám
alla
albam
aisteoir
#aimsirtg
aifric
aidh
aib
ago
agaibhse
a'am
young
yeow
yeh
yea
xox
xo
woo
when
what's
watch
usáid
uaisle
uaire
túsa
tuar
treise
traidisiúnta
traen
tour
toiseacht
toirneach
thuismitheoirí
thriall
thrá
thoill
thír
thiocfadh
they
than
thaifead
thacaíocht
text
t-eolas
telly
teist
teip
teideal
ted
#tdf
tapa
tábhairne
subh
sú
strae
stopann
#spraoi
soon
sliabh
#slánlepeadar
siul
sios
shráid
shite
shílim
share
seisiún
seastán
seafóid
scrudaithe
scriobh
scornach
scian
school
scaoil
same
sáinnithe
saineolaithe
sábháilte
rúnda
#roscommon
rómhaith
rialta
riachtanach
retweet
#rangduckabú
ranga
raining
rain
radio
prátaí
pósta
pointí
poca
playlist
piontaí
pictiúirí
phew
pháirtí
pháirc
pasfhocal
parlaiminteach
paris
páirc
páipéar
oráiste
orainne
oooh
oiriúnach
oibrigh
nuachta
nothing
notaí
#nollaig
ndéanann
ndaoine
narbh
#naomhpolabu
n-ais
music
mr
morán
m'intinn
mílte
milleán
mighty
mharú
mhalairt
mhaireann
meascán
#meas
martin
m'aonar
mála
maidine
m'aghaidh
luck
luas
lot
lost
looks
logainm
#lnms
liricí
léiriú
lee
leas
lead
leac
law
laura
#latelate
labhraíonn
là
kelly
johnson
johnny
jóc
jealous
jack
isn't
ise
íoslódáil
insint
i'll
huair
holiday
high
help
hata
hanam
halla
gus
gruaig
greann
greanmhar
#gradam
#grá
gortaithe
goodnight
gol
going
gheansaí
ghalánta
ghaelscoil
geall
gconai
gcoláiste
gcóir
gceol
gceathrú
gceapann
gceantar
gcalifornia
#galway
fútsa
fút
fucking
fr
fostaithe
foilsithe
first
fiacla
fhuaim
fhocail
fhirinne
fheiceál
fab
#f
euro
eorpach
eol
em
éisteach
eiri
eatarthu
ead
eabhrac
dúinne
dub
dtaitníonn
drochaimsir
draíocht
dóthain
dosna
dorchadas
díospóireacht
dhúchais
dhóthain
deireannach
deardaoin
deadly
deacrachtaí
dd
dath
darach
danny
d'ainm
daidí
cute
cumha
cuimhní
cú
cruinne
críoch
#coybig
cosc
corp
conradh
congrats
#comhra
comhgháirdeachas
coinneoidh
cogar
cogadh
cnoic
cloisim
cleachta
clainne
cith
chúrsaí
chuirfeadh
chuireas
chuimhne
chorcaí
chonaí
chomórtas
choíche
chodail
chluinstin
chlúdach
chloisim
chineál
chiaráin
cheartú
chéadaoin
change
chaite
chailleann
ch
ceathrar
ceapann
ceantar
ceannaithe
ceanainn
ceadaoin
canúint
caithfaidh
cáil
caifé
café
cád
caca
cabaret
buile
buan
buaite
bronnadh
bróga
brionglóid
breatimeacht
breathnach
bport
bpointe
bpaorach
bogásach
blog
biodh
bhúr
bhrón
bhosca
bhochta
bhionn
bhfuilimid
bhfón
bhfaighidh
bhéadh
bhád
béil
beart
bar
baisteach
bailiú
bagairt
bád
awk
away
athraigh
athchraoladh
ardú
ardteist
apple
aontas
an-bhródúil
amanna
amáireach
always
also
aistí
aisling
áis
áine
áilleacht
áille
ailbhe
after
a'd
act
ack
#achtanois
yo
yet
#yes
word
windows
wil
who
west
we'll
weather
úsáidim
úsáideann
úsáideach
until
unfortunately
ulster
ullamh
úaú
tut
tuath
tuaisceart
truaillíocht
trócaire
triú
tosaithe
tóraithe
tógtha
t-léinte
titley
tir
tiobraid
thugtar
thuairim
thicéad
thár
th'anam
teo
tearmann
tearma
teagmháil
teaghlaigh
teacs
tarraingt
tár
taoiseach
tamaillín
tam
taifeadta
tabharfaidh
support
summer
strus
stopadh
stíl
staire
spoirt
spalpadh
spáin
soisear
só
smith
sloinne
slainte
sioc
siobhán
síob
síniú
sicín
should
shóisialta
shíniú
sheanathair
shéan
shásta
shannon
set
seasamh
seachtainí
sciathán
scanraithe
scannal
scaití
sampla
sadhbh
run
rúis
ruairí
rotha
rossa
ronan
roll
rófhada
ró-dhéanach
rl
rialtais
riada
#repealthe
red
reatha
realt
reality
rásaí
rachel
rachainn
príomh
#popupgaeltacht
poor
polasaí
polaitíocht
polaiteorí
póg
piosa
phone
phóca
phoblacht
phíosa
pheil
pheadair
peaca
pat
pas
ospidéal
ordú
open
ooooh
ooh
old
okay
oireann
oideas
odhrán
nos
nóra
#nollaigshona
#neirbhíseach
neamh
ndícheall
naoise
naofa
n-aingeal
must
muinteoir
mts
mothúcháin
mothaim
monday
móire
moille
minice
millte
mike
might
mhiste
mhisneach
mhichíl
mheiriceá
mheán
mhealladh
mhaighdean
m'fhear
meiriceánach
#meathihc
mcguinness
mc
mbéinn
mbean
mbaol
mb
mayo
maybe
math
marú
mam
máistir
máirtín
mairfidh
machaire
lucky
luchóg
luch
looking
lóin
lisa
lios
lion
liathróid
leoir
leithreas
leibideacht
left
leathuair
leanaí
leamh
léacht
lauren
las
lar
laochra
laghdú
laetha
kevin
i've
itheann
ith
ísle
ipod
ipad
iondúil
ionat
iompar
iodáil
instagram
indreabhán
imíonn
idirnaisiúnta
iasc
iarriadh
iarratas
ian
hocht
hiúdaí
his
héirinn
héinne
hear
havin
harry
han
hamhráin
h-álainn
hainmhithe
had
gym
guthan
guí
grianmhar
gráinne
gorm
gonna
glór
glanadh
giolcanna
#gigá
gif
ghruaig
ghnóthach
ghleann
ghlan
ghearmáin
gháirdín
ghaeltachta
gearáin
geansaí
gcuirtear
gcuireann
gcroíthe
gcóras
gco
gcionn
gaelic
#gaeilgebheo
fun
fuisce
fuaireamar
frank
frances
francach
fola
foirne
foirm
foirgneamh
focain
fliú
físeáin
fior
fiona
fine
fianaise
fhreagairt
fhoilsiú
fhliuch
fheachtas
feisirí
feck
fearthainn
feall
féachann
feach
faoiseamh
et
er
episode
#ep
eoraip
enjoy
eisean
#éire
eipeasóid
einne
eimear
#edchatie
éanna
éadmhar
dvd
dúnadh
duil
dualgas
dtugtar
dtiocfadh
dtí'n
dteilifís
dteangacha
dtagann
drive
d'ordaigh
doiligh
dochtúir
díriú
díon
díomách
díom
díolta
díol
dingle
dhúisigh
dhúirt
dhícheall
dhiadh
dheara
dheanann
dhéanach
dhán
dháithí
dhaid
dennis
delighted
déistin
deirfinn
d'athraigh
dathanna
date
darragh
darna
dark
d'achan
cúla
cuirtear
cuirfear
cuimhnigh
cuimhneamh
cuardach
cronaim
crap
cosmhuintir
cor
conspóideach
#conamara
con
comhlachtaí
comhlacht
comhgairdeas
comharthaí
coladh
coiste
coire
cóir
coinneáil
cnag
cló
clárú
cláir
cian
chuirfinn
chuireadh
chughainn
chrua
chreid
chosa
chorn
chorca
chlos
cheers
cheapfainn
chathaoir
chaoin
chanúint
chaitlín
cháirde
chabhair
ceoltóirí
ceo
céime
ceilteach
ceathrú
cartaí
carn
canna
canathaobh
camino
caithfimid
cailligí
cáiliúil
cailini
cabinet
bunúsach
bunusach
bunscoil
bullaí
buachaint
bruscar
brónies
bríd
brid
breoite
bréige
#breatimeacht
breathnu
breac
brath
braon
braitheann
bpost
bpobal
boys
botúin
boris
boicht
boc
blues
#bliainnagaeilge
bláthanna
blair
bhronntanas
bhrónach
bhféadfá
bhfaigheann
bheo
bhéinn
bheilg
bhán
bhal
bhác
better
bernie
beoir
beith
beagánín
bbz
bbq
barúil
baistí
babaí
available
athraithe
athair
astu
an-tuirseach
an-time
an-taitneamh
an-spraoi
an-oíche
an-lá
aníos
an-díomá
an-chliste
a'msa
already
alba
al
aithníonn
aiseolas
ainmhí
aineolach
aigne
aifreann
aibreán
aibreáin
ahhhh
aha
agoa
agallaimh
adhamhnáin
adhamhnain
yoga
xoxo
xmas
xl
wrong
worse
worries
world
woop
wooo
#wildatlanticway
went
weeks
vótaí
use
un
uk
uibh
úafásach
tus
tuit
tuistí
tuismitheoirí
tuiscint
tugaim
tslí
tsiopa
true
trína
trid
translation
trailer
tragóideach
tra
torann
togra
toghcháin
tog
tionscadal
ticead
thursday
thrua
through
thráchtas
thosú
thoradh
thóir
thing
th'éis
termann
téarmaí
td
tayto
tara
taon
talún
t-alt
taimid
tàim
t-agallamh
tag
t-adh
tacsaí
syriza
suis
súgradh
stupid
#stpatricksday
stor
starbucks
stáisiún
spreag
sport
spin
spáinn
sord
sorcha
something
sóisialta
smaointí
sliocht
slad
sinéad
síne
simplí
simon
shúil
shrón
shiúil
shit
shín
sheasamh
sheans
shéamuis
sheachaint
shasana
#shanebeirneshield
sháith
sfc
service
senior
sén
semi-final
seit
seisean
seattle
seasann
sean-nós
scuaine
scoláirí
scoláire
scoith
sciobairín
scata
scaoileadh
saturday
sárú
sarah
sar
#saoirse
santaí
saineolaí
sáile
s'agam
ró-te
rón
rómhall
roibéard
roger
rnal
rn
rírá
riomhaire
ríomh
ríocht
rian
rialacha
relegation
réitithe
réaltán
réaltaí
real
read
re
ráiméis
rabh
pretty
potter
polaitíochta
plug
pleanáil
playoff
plaisteach
photo
phlean
phian
people
patrick's
patrick
pangur
other
#osna
orla
órga
oops
oirthear
oidhreacht
óiche
ny
noooo
nod
nocht
nglaschú
ng
n'éirí
n-éireoidh
needed
nead
ndiadh
ndeor
ndéana
ndairire
nath
nádúrtha
nách
murab
muireann
muinín
muineachán
ms
moscó
modh
m'obair
mna
mmmm
mm
mithid
miste
missed
míshásta
mionlach
mind
michelle
micheal
mholfainn
mhná
mhéara
mhathair
mháirt
mhaigh
m'fhón
memories
meh
méar
mcgurk
mbosca
mbialann
mbfc
mbf
mbeirimíd
mbearla
mbaineann
mbád
maoiniú
m'anam
maitheas
maidín
madadh
lynette
lu
lou
los
lóistín
loighic
lo
litrithe
ligeann
#lfc
leithéidí
leisciúil
leighis
leid
leictreachas
leathan
leathair
learn
léargas
leannúint
leadrán
late
lasta
larf
laoire
#laoch
laistigh
kerry
journal
jim
jennifer
jason
itunes
íoróin
ionas
innui
#indyref
inbhir
inann
imreoirí
imreoir
imeartas
ifreann
iarratais
huile
hot
horrible
hoileáin
híontach
him
hí
her
héireannaigh
heireann
heaglaise
haoibhinn
halban
habhann
guthán
gruaim
grrr
griangraf
grianghraif
gort
gone
golden
gníomhach
ginearálta
ghrúpa
ghréig
ghramadach
ghra
ghnó
ghlaoigh
ghlanadh
ghearóid
gharraí
ghaelach
ghabháil
gerry
geimhreadh
gearradh
gearmáinis
gcuirfidh
gcomhrá
gcobác
gcás
gcairde
gann
game
galar
gála
gal
#gàidhlig
gaelainn
gaelacha
#gaeilgeatul
#gaeilgeabú
#gaabeo
fúm
fuckin
fuaire
french
freagraí
freagair
fran
fraincis
form
forleathan
forgot
foras
fomo
folamh
foighne
fiu
fiosrú
fillte
filíochta
#filíocht
filíocht
filí
fiáin
fhuar
fhógra
fhoclóir
fhir
fhionnuisce
fheile
fheicfidh
fhéadfadh
fhaighim
feoil
féir
feiceail
feeling
féar
féadfaidh
#fb
fan-san-ae
fanfaidh
fágann
face
exam
ex
eolas@user.ie
emotional
eitleán
either
éiríonn
eirí
éireannacha
eireann
eilvéis
éileamh
eek
éamonn
eamonn
#éalú
eagar
#dúshlán
#dushlan
d'úsáid
dup
dúchasaigh
dtuigim
dtuaisceart
dtraipisí
dtólamh
dreoilín
drama
double
dónall
doireann
doesn't
dochreidthe
div
direction
díomach
#díoma
d'íoc
dinnear
difear
didn't
díbh
dhuibh
dhomhanda
dhinnéar
dheireannach
dheineas
d'fhan
déithe
#déiseabú
d'éinne
death
dearbhán
déantar
deanfaidh
deacracht
dátheangach
damn
cursaí
cúntas
cumhachta
cumasach
cumadh
cuidiu
crochta
crainn
cough
cóta
cosúlachta
#corcaigh
conspóid
connacht
comóradh
comhthéacs
comáin
coitianta
coimeád
codlata
codhladh
cód
clúdach
cluas
cloiseann
cloigeann
cliú
clare
cláracha
ciníochas
cille
ciallmhar
chuirim
chuimhin
chúige
chualas
chruthú
#christmas
chraobh
chóras
chomhluadar
chomhdháil
chomhbhrón
chogadh
chnoc
chloisint
cheo
cheathrú
chasadh
chairn
cháin
chailleamar
chailleadh
chaife
ceatharlach
ceathar
ceartú
ceapairí
ceannaigh
ceannach
ceangal
#ceanada
céadta
ceachtanna
cavan
castáil
carthaigh
capall
capaill
caoimhe
campa
caidrimh
caide
cadhain
button
bunú
buaiteoirí
bronntanais
british
brilliant
briathar
breatnais
bréagach
bréag
bpian
boscaí
boom
bon
bolg
bob
blocáilte
bloc
blitz
black
bigi
bias
bhuachaill
bhriseadh
bhóthar
bhóthair
bhliana
bhláth
bhialann
bhfeidir
bheifeá
bhaineas
bhaineamar
bfhuil
bfheidir
because
beathach
beartaithe
bearna
béarlachas
béaltriail
beal
barbara
baisti
#báisteach
baiste
awwww
autocorrect
au
#asgaeilge
asal
arú
arlíne
argh
#arbís
arbh
árainn
aosta
aontaíonn
aonghuis
aodha
an-tinn
anso
an-ghnóthach
an-díoma
an-dheas
amhrasach
amaideach
aka
aisti
áirne
ainneoin
ainmnithe
ainmneacha
aiféala
ahem
ages
age
added
acht
#a
zú
zappone
yuck
yah
whoop
white
which
website
water
watching
waste
wana
wake
wahey
vu
vodafone
viral
vincent
victoria
úúúú
úsáidtear
urlár
updates
upc
ukip
uíbh
ufásach
údarásach
uaithi
uairibh
uaigneas
uafásacha
two
tweeting
tweeteoirí
tvúit
#tusatube
tuíteanna
tuiteáil
túit
túisce
tuilte
tugaigí
tubaiste
tuaithe
tuaiscirt
tsúilí
tsín
tseirbhís
tsaol
tsamhradh
tromluí
trioblóid
trident
treoir
treochtáil
trathnóna
trátaí
town
tournament
totally
tosóidh
tón
toghchán
titeann
tionól
tiománaithe
tiománaí
tiarna
thusa
thús
thriail
thráthnóna
thosnaigh
thomas
thoir
thiarna
there's
them
tharraing
tharr
thaitníonn
thaiscidh
thaighde
thá
teorann
#teip
teicneolaíocht
teastas
teastail
teann
teachtaireachtaí
tea
tatay
tapaigh
tanaí
tán
tan
take
taistil
#taisteal
taispeántas
tairiscint
taifeadadh
tagairtí
sweet
surprise
sup
suntasach
súl
suíochán
street
stream
strachailt
story
stopfaidh
stoirme
stóirín
steve
start
stailc
staidéir
sruth
sráide
square
splanc
spíonta
speaking
speak
spéaclaí
spáis
sound
sotalacha
sort
sore
sóisear
sóisealachas
socróidh
sniff
snas
smior
smidiríní
smaoiním
smaoineadh
sláintiúil
slaghdan
sl
sionnach
sínte
sinne
silím
sign
sic
siadsan
shur
shuaimhneas
shout
sholas
shneachta
shláinte
sheolann
shéid
sheáinín
shaoil
shannen
shaghas
sesh
series
seod
sentence
sé'n
seirbhísí
seasta
searbhas
searbh
seapáinis
sean-ghaeilge
#seanfhocalanlae
sè
scuab
scruduithe
scrudú
scriosadh
scríos
scríobhaim
scríbe
score
scíth
scileanna
scil
sciath
sceitimíneach
scéalaí
scamall
scairt
scaipthe
sbb
saxe-coburg
sat
sásamh
sár-jab
sár-iarracht
santa
saighdiúirí
s'aige
saibhreas
saibhir
s'agamsa
sádaí
sacair
ryanair
rte
round
#rosnarun
rósanna
rós
roisin
rois
roinnfidh
ró-dheacair
rock
ritheann
ríomhairí
ríoga
rio
rinneamar
ríl
riain
renua
réalta
rása
raith
#raidió
ráflaí
quot
put
probably
préachta
praiseach
práinneach
pósadh
pop-up
popup
#popraidio
polaiteoirí
poiblíocht
pleananna
pleanála
píosín
piocadh
piece
pictuirí
pictúir
phraghas
phionta
phioc
philip
phiarsaigh
pheata
phápa
#peilnamban
peig
peann
party
paisti
painéal
own
outside
#otd
óstán
osna
#óró
óráid
oohh
ómós
ollchlár
olcas
oisín
oighir
oidis
oidhreachta
ohhh
o'hara
#obair
nyc
nuala
nota
nooooo
nom
nóiméid
nóim
n-oibríonn
#nílsécgl
nílimse
nílimid
niallais
nhs
ngleic
ngleann
nfheadar
neirí
n-éiri
n-eiri
néill
neil
neamhaird
ne
ndúirt
ndoigh
ndéithe
ndeireadh
ndéantar
ndáiríribh
national
nathanna
nárbh
name
#nama
nag
nada
nà
myself
murderer
mumha
muis
muga
mt
mon
molta
molly
míse
mine
milliún
mídhleathach
mhuinteoir
mhúineadh
mhóir
mhicheál
mhéar
mhath
mhamó
mháirtín
mhair
meoin
men
meicsiceo
meeting
#meathsfc
meánaicme
mbuidéal
mbostún
mbím
mbáisteach
maslaithe
maria
margaíochta
marbhánta
maraithe
manach
malaí
making
makes
make
maitiú
máithreacha
mairtín
mairg
maireann
maíomh
mainistir
mail
made
mad
lyall
lunasa
luimnigh
lucy
luach
loves
lovely
lotto
loretta
lonnaithe
lom
lógó
lochtach
lipéad
#líofa
#liofa
línte
liadh
lets
léiríonn
léim
leictreonach
leibhéal
#leavingcert
leathcheannais
leathanaigh
leanúnach
leanúna
leanfaidh
leanaigí
leamhcán
leaganacha
leadranach
laoise
lamh
láithreoirí
láimh
laga
ladies
kuenssberg
knowsley
kickstarter
#kennymustgo
joseph
joey
jo
jet
jen
jeez
jcorbyn
iúir
isle
ísiltír
íseal
iriseoireacht
iosrael
iontais
iománaíocht
iomána
iomaíocht
inseacht
inn
inar
imríonn
impiriúlachas
ilen
il
#ifta
idirlion
idea
id
iarthair
iarnród
iadsan
hunt
human
hoody
hoo
hoifigiúil
ho
hionann
hinis
hilary
heorpa
hell
héin
héasca
hayes
hataí
#hash
haois
hangover
ham
#halloween
hall
h-áite
hainnis
haiku
#gutted
gunna
gul
guitar
guím
grúpaí
grinn
green
#gradaim
gradaim
grace
goodbye
goile
goideadh
goid
god
gníomh
glóire
gliomach
glasraí
glamour
glacfaidh
giorra
ginideach
gift
ghuthan
ghuth
ghúna
ghlas
ghearr
ghasúr
ghàidhlig
ghaeilgeoirí
gh
george
geography
geata
gearrtha
gearmánach
gealltanas
gcúpla
gcultúr
gcrann
gcomparáid
gcloch
gcló
gceolchoirm
gceanada
gceadaoin
gcat
gcailín
gasta
garraí
gaisce
#gaillimhabú
gaeltachtaí
gabriel
gabhann
future
fúthu
fusa
furasta
fúithi
fuacht
ft
fs
frustrachas
frithshóisialcha
freis
freagairt
fotheidil
fostaíochta
fórsa
food
fon
focla
fml
florence
flat
flaithis
físeanna
fiosrach
fíormhaith
film
fiaclóir
fhreagra
fhraincis
fhón
fhoirm
fhíseán
fhíos
fhéinig
fheadar
fhásann
fhaigheann
fhágaint
fgb
ffs
few
fén
féilte
feidhmiú
feicimid
féich
feicfimid
feels
feasta
feasa
fearthainne
feargach
fearadh
feadóg
favourite
fancy
faisean
fágaint
fágadh
extra
example
ever
evening
even
eugh
essay
entry
enough
enjoyed
english
enda
electric
eist
éireannaigh
eiméid
eibhlín
ed
easnamh
eanair
ealaíontóir
ealaíne
eagraithe
#éad
eachtra
each
duvet
dúnaibh
duinn
dtugann
dtosach
dtonnta
dtoghchán
dtín
dtéann
dtarlaíonn
dtamhlacht
dtaithí
drochmheas
dominic
doll
doibh
#dóchas
dobhráin
diúltach
díoltas
díobháil
dínn
dímheas
died
d'iarr
dialann
dhubh
dhona
dhochtúir
dhíbh
dhéanfainn
dhéanfaimid
dhéanaim
dhath
d'fhágas
devs
déjà
#déise
déise
déileáil
deifir
dee
deartháir
déarfadh
deanai
deanach
deal
d'eagraigh
déagóirí
deacra
dc
dathúil
darbh
dāra
d'aon
#dána
dan
damhán
dalta
dallamullóg
dall
d'abróinn
cv
cursai
curamach
cúr
cúpan
cunamh
cumhachtach
culaith
cuirigí
cuirfimid
cuilinn
cúilín
cuig
cuartú
cruthú
cruálach
crossed
crois
cróga
crochadh
criú
cripes
criospaí
críonna
creidimh
creideann
creideamh
créatúir
crainnte
craiceann
craiceailte
crá
cp
cox
course
couldn't
cothú
cosúlachtaí
cosmhuintire
cosa
correct
corraitheach
corr
cormac
connor
connemara
conghaile
conall
colaiste
coiscéim
coirpeach
coffee
clog
cláraigh
clagarnach
city
citeal
cíos
ciarraíoch
chursa
church
chumann
chumadh
chúlra
chuisneoir
chuirfidh
chris
chríochnú
chreidiúint
chraoladh
chrá
chóta
chósta
chosaint
chondae
chonac
chomhartha
cholm
choiste
chóisir
chóip
choimeád
choiméad
chloisteail
chleachtadh
chífidh
cheiliúradh
chearnóg
cheardlann
cheapaire
cheantair
cheannais
chárta
charghas
chapall
chaoimhe
chance
chaitliceach
chairman
chailliúint
cháca
chac
ceoltóir
celtic
ceiltigh
ceathrair
#cearta
ceardlann
ceaptha
ceapaire
ceanada
ceallaigh
ceall
ceadaithe
cathú
cathaoir
cards
carachtar
cár
caoimhín
cannaí
caithim
caisleáin
cainteoirí
cainteoir
cailte
caillfidh
cailiní
cách
cabhrú
cabhrach
buzz
busy
busanna
búrca
building
buaicphointí
buachan
brothers
#brón
bróin
britain
bríomhar
briathra
bréan
breà
bréa
bráth
brady
brádán
bplé
bos
bliantúil
bleh
blaiseadh
bitch
bionn
bhuachan
bhruiséil
bhródúil
bhreis
bhreallaire
bhrat
bhrasaíl
bhoth
bhios
bhíonns
bhíodar
bhileoga
bhig
bhfuaireas
bhfreishir
bhfód
bhfeachtas
bhfaighfidh
bheatha
bhearla
bhás
bharbs
bhall
bháistí
bhail
bhagairt
bfhéidir
belfast
beirte
béim
básaithe
barry
barróg
baolach
b'aoibhinn
bank
bándearg
band
balla
báire
baby
babes
babe
atmaisféar
atlantaigh
athimirt
astráil
asat
arthur
arna
ardteiste
ardmholadh
ardán
ardaíonn
araon
aráin
apparently
aonaigh
an-tógtha
an-thuirseach
an-te
an-suimiúil
an-suim
an-smaoineamh
ansiúd
an-obair
annamh
an-mhór
#anghaeilge
an-fhada
andrew
an-deacair
an-chlár
an-bhlasta
ana-mhaith
an-álainn
anáil
amhránaíochta
amhránaí
america
amazon
amarch
ámarach
amaidí
#allireland
ali
aldi
alán
#álainn
alainn
aithint
aithin
aistriúcháin
airim
aireoidh
ainmhithe
aineolas
aine
aimsigh
ailt
aidan
áibhéil
ahhhhh
agut
agree
agm
afach
aerach
admháil
action
acadamh
absolutely
abrahamach
abhus
abhí
abhar
abhainn
yous
you'd
yippee
yikes
yer
<UNK>
